"""
演示数据容器中的字典的定义
字典同集合一样，不可以使用下标索引
"""
# 定义字典
my_dict = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77}
# 定义空字典
my_dict2 = {}
my_dict2 = dict()
print(my_dict2)

# 定义重复key的字典 字典中的字不允许重复，如果重复虽然不报错，但是会覆盖前面的key,从而记录后面的值。

my_dict3 = {"王力宏": 33, "王力宏": 55}
print(my_dict3)

# 从字典中基于key获取Value值
my_dict = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77}
score1 = my_dict["王力宏"]
print(score1)
score2 = my_dict["林俊杰"]
print(score2)

# 字典的嵌套
# 字典的key和Value可以是任意数据类型，但是key不可以是字典
# 那么，就表明字典可以嵌套
# 需求如下：记录学生各科的考试信息

stu_score_dict = {
    "王力宏": {"语文": 77,
               "数学": 66,
               "英语": 33
            },
    "周杰伦": {
        "语文": 88,
        "数学": 86,
        "英语": 55
    },
    "林俊杰": {"语文": 99,
               "数学": 96,
               "英语": 66
    }
}

print(stu_score_dict["林俊杰"]["数学"])